package HomeWork10;

/*
 * Задание по внутренним классам:
Создать класс City (город) с внутренним классом, с помощью объектов которого можно хранить информацию о проспектах, улицах, площадях.
Внутренний класс в задании должен быть один для площадей, один для улиц и тд. Просто с переменной String, которая сможет хранит и названия улиц и названия площадей.
Т.e. класс City содержит несколько переменных с типом внутреннего класса в которых записано название улици проспекта и тд.
 */

public class HomeWork10city {

	public static void main(String[] args) {
		{
			City town = new Minsk();
			//System.out.println(town.toString());
		}

	}

}
